#include "gameRule.h"
#include <iostream>
#include <stdlib.h>

using namespace std;

void gameRule() {
	system("cls");
	cout << "이 게임은 포커를 이용한 배틀 게임입니다.\n"
		<< "선공 플레이어는 체력 100과 다이아 10개로 후공 플레이어는 체력 110과 다이아 15개로 게임을 시작합니다.\n"
		<< "최대 체력은 150이며, 최대 다이아의 갯수는 99개 입니다.\n"
		<< "각 플레이어는 자신의 턴이 시작 될 때 카드 7장을 받습니다.\n"
		<< "이후 카드를 사용하기 전에 다이아 3개당 카드 1장을 교환할 수 있습니다.\n"
		<< "교환한 카드를 재교환할 수 있습니다.\n"
		<< "카드 교환을 마친 후 플레이어는 카드를 사용합니다.\n"
		<< "플레이어는 기본으로 1장의 카드를 사용할 수 있습니다.\n"
		<< "똑같은 숫자의 카드가 있을 때마다 사용할 수 있는 카드의 수가 늘어납니다.\n"
		<< "더블인 경우 +1장, 트리플인 경우 +2장, 포카드인 경우 +4장이 경우만큼 늘어납니다.\n"
		<< "예시로 숫자가 5,5,2,2,2,3,3의 숫자가 나왔을 때,\n"
		<< "기본으로 1장, 5더블로 인해 1장, 2트리플로 인해 2장, 3더블로 인해 1장이 늘어나 총 5장을 사용할 수 있습니다.\n"
		<< "카드를 사용했을 때의 효과는 문양마다 다르며, 각 카드 문양에 따른 효과는 다음과 같습니다.\n"
		<< "♠카드는 카드의 숫자만큼 상대를 공격합니다.\n"
		<< "◆카드는 카드의 숫자만큼 다이아를 획득합니다.\n"
		<< "♥카드는 카드의 숫자만큼 자신의 체력을 회복합니다.\n"
		<< "♣카드는 랜덤으로 ♠,◆,♥중 하나의 카드로 변해 그 카드의 효과를 발휘합니다.\n"
		<< "또한, 카드는 1장당 한 번씩만 사용 가능합니다.\n"
		<< "위와 같은 규칙으로 한 플레이어의 체력이 0이 될 때까지 게임을 진행합니다.\n"
		<< "그럼 즐거운 플레이하시기 바랍니다.\n";
}
